import {ColumnDef} from "@tanstack/react-table";
import {RouteMap} from "@/types/routeMap";
import Image from "next/image";

export const dummyRouteMapData = [
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
  {
    "1": 'I26K6',
    "2": '동해선',
    "3": '005FA8',
    "4": '/line-outline.svg',
    "5": "부천",
    "6": "태화강",
    "7": "8001-부천역,8002-거제해맞이역,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,8003-거제,",
    "8": "2025-05-25",
    "9": "2025-05-25"
  },
]

export const routeMapColumns: ColumnDef<RouteMap>[] = [
  {
    accessorKey: '1',
    header: '노선번호',
  },
  {
    accessorKey: '2',
    header: '노선명',
  },
  {
    accessorKey: '3',
    header: '색상',
  },
  {
    accessorKey: '4',
    header: '아이콘',
    cell: info => {
      const value = info.getValue<string>()

      return (
        <Image src={value} alt={''} width={20} height={20}/>
      )
    }
  },
  {
    accessorKey: '5',
    header: '기점',
  },
  {
    accessorKey: '6',
    header: '종점',
  },
  {
    accessorKey: '7',
    header: '정거장 구성',
    cell: info => {
      const value = info.getValue<string>();
      return (
        <div style={{maxWidth:'300px',overflowX:'hidden', textOverflow:'ellipsis', whiteSpace:'nowrap'}}>
          {value}
        </div>
    );
    },
  },
  {
    accessorKey: '8',
    header: '개통일자',
  },
  {
    accessorKey: '9',
    header: '데이터기준일자',
  },
];
